app/views/properties/index.html.erb


        <% (Property.all).each do |property| %>
---
SELECT "properties".* FROM "properties"