app/controllers/profile_controller.rb

  def dashboard
     @properties = Property.all
---
SELECT "properties".* FROM "properties" WHERE (user_id = '1')