app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" WHERE (user_id = '1')
---
   def new
       @properties = Property.all

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def show
        @property = Property.find(params[:id])

INSERT INTO "properties" ("street", "city", "state", "zipcode", "price", "bathrooms", "bedrooms", "amenities", "description", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["street", "419"], ["city", "Iowa City"], ["state", "IA"], ["zipcode", 52240], ["price", 430], ["bathrooms", 3], ["bedrooms", 6], ["amenities", "Bubbles"], ["description", "A dog"], ["user_id", 2]]
---
   def create
     @properties = Property.create!(prop_params)