app/views/profile/_side_menu.html.erb

                             </li>
                            <% (Property.all).each do |prop| %>
---
SELECT "properties".* FROM "properties" WHERE (user_id = '1')