app/views/profile/properties.html.erb

SELECT "properties".* FROM "properties"
---

            <% (Property.all).each do |property| %>